<?php

declare(strict_types=1);

return [
    /*
<<<<<<< HEAD
=======
<<<<<<< HEAD
>>>>>>> 81efa49 (.)
     * |------------------------------------------------- -------------------------
     * | Table Columns
     * |------------------------------------------------- -------------------------
     */
<<<<<<< HEAD
=======
=======
    |------------------------------------------------- -------------------------
    | Table Columns
    |------------------------------------------------- -------------------------
    */
>>>>>>> origin/develop
>>>>>>> 81efa49 (.)

    'column.name' => 'Имя',
    'column.guard_name' => 'Имя гварда',
    'column.roles' => 'Роли',
    'column.permissions' => 'Разрешения',
    'column.updated_at' => 'Обновлено',
<<<<<<< HEAD
=======
<<<<<<< HEAD
>>>>>>> 81efa49 (.)
    /*
     * |------------------------------------------------- -------------------------
     * | Form Fields
     * |------------------------------------------------- -------------------------
     */
<<<<<<< HEAD
=======
=======

    /*
    |------------------------------------------------- -------------------------
    | Form Fields
    |------------------------------------------------- -------------------------
    */
>>>>>>> origin/develop
>>>>>>> 81efa49 (.)

    'field.name' => 'Имя',
    'field.guard_name' => 'Имя гварда',
    'field.permissions' => 'Разрешения',
    'field.select_all.name' => 'Выбрать все',
    'field.select_all.message' => 'Включить все разрешения, которые <span class="text-primary font-medium">Доступны</span> для этой роли',
<<<<<<< HEAD
=======
<<<<<<< HEAD
>>>>>>> 81efa49 (.)
    /*
     * |------------------------------------------------- -------------------------
     * | Navigation & Resource
     * |------------------------------------------------- -------------------------
     */
<<<<<<< HEAD
=======
=======

    /*
    |------------------------------------------------- -------------------------
    | Navigation & Resource
    |------------------------------------------------- -------------------------
    */
>>>>>>> origin/develop
>>>>>>> 81efa49 (.)

    'nav.group' => 'Filament Shield',
    'nav.role.label' => 'Роли',
    'nav.role.icon' => 'heroicon-o-shield-check',
    'resource.label.role' => 'Роль',
    'resource.label.roles' => 'Роли',
<<<<<<< HEAD
=======
<<<<<<< HEAD
>>>>>>> 81efa49 (.)
    /*
     * |------------------------------------------------- -------------------------
     * | Section & Tabs
     * |------------------------------------------------- -------------------------
     */
<<<<<<< HEAD
=======
=======

    /*
    |------------------------------------------------- -------------------------
    | Section & Tabs
    |------------------------------------------------- -------------------------
    */
>>>>>>> origin/develop
>>>>>>> 81efa49 (.)

    'section' => 'Сути',
    'resources' => 'Ресурсы',
    'widgets' => 'Виджеты',
    'pages' => 'Страницы',
    'custom' => 'Пользовательские разрешения',
<<<<<<< HEAD
=======
<<<<<<< HEAD
>>>>>>> 81efa49 (.)
    /*
     * |------------------------------------------------- -------------------------
     * | Messages
     * |------------------------------------------------- -------------------------
     */

    'forbidden' => 'У вас нет доступа',
    /*
     * |------------------------------------------------- -------------------------
     * | Resource Permissions' Labels
     * |------------------------------------------------- -------------------------
     */
<<<<<<< HEAD
=======
=======

    /*
    |------------------------------------------------- -------------------------
    | Messages
    |------------------------------------------------- -------------------------
    */

    'forbidden' => 'У вас нет доступа',

    /*
    |------------------------------------------------- -------------------------
    | Resource Permissions' Labels
    |------------------------------------------------- -------------------------
    */
>>>>>>> origin/develop
>>>>>>> 81efa49 (.)

    'resource_permission_prefixes_labels' => [
        'view' => 'Просмотр',
        'view_any' => 'Может смотреть любое',
        'create' => 'Создание',
        'update' => 'Обновление',
        'delete' => 'Удаление',
        'delete_any' => 'Может удалить любой',
        'force_delete' => 'Принудительно удалить',
        'force_delete_any' => 'Может принудительно удалить любой',
        'restore' => 'Восстановление',
        'reorder' => 'Изменение порядка',
        'restore_any' => 'Может восстановить любой',
        'replicate' => 'Копировать',
    ],
];
