<?php

declare(strict_types=1);

return [
    /*
<<<<<<< HEAD
<<<<<<< HEAD
=======
>>>>>>> 6d20fbe (.)
     * |------------------------------------------------- -------------------------
     * | Table Columns
     * |------------------------------------------------- -------------------------
     */
<<<<<<< HEAD
=======
    |------------------------------------------------- -------------------------
    | Table Columns
    |------------------------------------------------- -------------------------
    */
>>>>>>> fbc8f8e (.)
=======
>>>>>>> 6d20fbe (.)

    'column.name' => 'Ім\'я',
    'column.guard_name' => 'Ім\'я гварда',
    'column.roles' => 'Ролі',
    'column.permissions' => 'Дозволи',
    'column.updated_at' => 'Оновлено',
<<<<<<< HEAD
<<<<<<< HEAD
=======
>>>>>>> 6d20fbe (.)
    /*
     * |------------------------------------------------- -------------------------
     * | Form Fields
     * |------------------------------------------------- -------------------------
     */
<<<<<<< HEAD
=======

    /*
    |------------------------------------------------- -------------------------
    | Form Fields
    |------------------------------------------------- -------------------------
    */
>>>>>>> fbc8f8e (.)
=======
>>>>>>> 6d20fbe (.)

    'field.name' => 'Ім\'я',
    'field.guard_name' => 'Ім\'я гварда',
    'field.permissions' => 'Дозволи',
    'field.select_all.name' => 'Вибрати все',
    'field.select_all.message' => 'Включити всі дозволи, які <span class="text-primary font-medium">Доступні</span> для цієї ролі',
<<<<<<< HEAD
<<<<<<< HEAD
=======
>>>>>>> 6d20fbe (.)
    /*
     * |------------------------------------------------- -------------------------
     * | Navigation & Resource
     * |------------------------------------------------- -------------------------
     */
<<<<<<< HEAD
=======

    /*
    |------------------------------------------------- -------------------------
    | Navigation & Resource
    |------------------------------------------------- -------------------------
    */
>>>>>>> fbc8f8e (.)
=======
>>>>>>> 6d20fbe (.)

    'nav.group' => 'Filament Shield',
    'nav.role.label' => 'Ролі',
    'nav.role.icon' => 'heroicon-o-shield-check',
    'resource.label.role' => 'Роль',
    'resource.label.roles' => 'Ролі',
<<<<<<< HEAD
<<<<<<< HEAD
=======
>>>>>>> 6d20fbe (.)
    /*
     * |------------------------------------------------- -------------------------
     * | Section & Tabs
     * |------------------------------------------------- -------------------------
     */
<<<<<<< HEAD
=======

    /*
    |------------------------------------------------- -------------------------
    | Section & Tabs
    |------------------------------------------------- -------------------------
    */
>>>>>>> fbc8f8e (.)
=======
>>>>>>> 6d20fbe (.)

    'section' => 'Сутності',
    'resources' => 'Ресурси',
    'widgets' => 'Віджети',
    'pages' => 'Сторінки',
    'custom' => 'Користувальницькі дозволи',
<<<<<<< HEAD
<<<<<<< HEAD
=======
>>>>>>> 6d20fbe (.)
    /*
     * |------------------------------------------------- -------------------------
     * | Messages
     * |------------------------------------------------- -------------------------
     */

    'forbidden' => 'У вас немає доступу',
    /*
     * |------------------------------------------------- -------------------------
     * | Resource Permissions' Labels
     * |------------------------------------------------- -------------------------
     */
<<<<<<< HEAD
=======

    /*
    |------------------------------------------------- -------------------------
    | Messages
    |------------------------------------------------- -------------------------
    */

    'forbidden' => 'У вас немає доступу',

    /*
    |------------------------------------------------- -------------------------
    | Resource Permissions' Labels
    |------------------------------------------------- -------------------------
    */
>>>>>>> fbc8f8e (.)
=======
>>>>>>> 6d20fbe (.)

    'resource_permission_prefixes_labels' => [
        'view' => 'Перегляд',
        'view_any' => 'Може дивитися будь-яке',
        'create' => 'Створення',
        'update' => 'Оновлення',
        'delete' => 'Видалення',
        'delete_any' => 'Може видалити будь-який',
        'force_delete' => 'Примусово видалити',
        'force_delete_any' => 'Може примусово видалити будь-який',
        'restore' => 'Відновлення',
        'reorder' => 'Зміна порядку',
        'restore_any' => 'Може відновити будь-який',
        'replicate' => 'Копіювати',
    ],
];
